// var 의 특징
// 일반 코딩 방식과 많이 다르게 동작함
// var 을 사용하면 코드의 가독성 과 유지보수에 좋지 않음

// 1. 변수를 선언하는 키워드 없이 선언 할당이 가능하다.
// 선언인지 재할당 인지 구분하기 어려움
somthing = '🍎';
console.log(typeof somthing);

// 동일한 변수 이름으로 재 선언하는게 가능하다.
// 기본적으로 let 과 const 는 재선언 하는게 불가능 하다.
var poo = '💩';
var poo = '💩'

console.log(poo);

// 기본적으로 원리는 블럭 내부에서 선언한 변수는 블럭 내부에서만 사용가능하다.
// 하지만 var을 사용할경우 이를 무시하게 된다.
var apple = '사과';
{
    var apple = '🍎';
    {
        var apple = '🥝';
    }
}
console.log(apple);

    // 함수 레벨 스코프만 지원함
function example(){
    var dog = '🐶';
}
console.log(dog);